id: c44269aa-9879-42d9-a8f4-56a93bb8c6ac
name: Dangerous API permission consented
version: 1.0.0
kind: Scheduled
description: |
  One or more high priv API permission were granted to an application.

  Check if this is really necessary and otherwise remove the permissions
severity: High
queryFrequency: 31m
queryPeriod: 31m
triggerOperator: gt
triggerThreshold: 0
tactics:
- Persistence
query: |-
  let DangerousPermissions = dynamic(["AppRoleAssignment.ReadWrite.All","Application.ReadWrite.All","RoleManagement.ReadWrite.Directory"]);
  AuditLogs
  | where OperationName == "Add app role assignment to service principal"
  | where Result =~ "success"
  | mv-expand TargetResources
  | mv-expand TargetResources.modifiedProperties
  | where TargetResources_modifiedProperties.name == "AppRole.Value"
  | extend InitiatingUserOrApp = tostring(InitiatedBy.user.userPrincipalName)
  | extend InitiatingIpAddress = tostring(InitiatedBy.user.ipAddress)
  | extend UserAgent = iff(AdditionalDetails[0].key == "User-Agent",tostring(AdditionalDetails[0].value),"")
  | extend AddedPermission = replace_string(tostring(TargetResources_modifiedProperties.newValue),'"','')
  | where AddedPermission in~ ( DangerousPermissions )
  | mv-expand TargetResources.modifiedProperties
  | where TargetResources_modifiedProperties.name == "ServicePrincipal.ObjectID"
  | extend ServicePrincipalObjectID = replace_string(tostring(TargetResources_modifiedProperties.newValue),'"','')
  | extend timestamp = TimeGenerated, AccountCustomEntity = InitiatingUserOrApp, IPCustomEntity = InitiatingIpAddress
suppressionEnabled: false
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    matchingMethod: AllEntities
    reopenClosedIncident: false
    groupByCustomDetails: []
    groupByEntities: []
    groupByAlertDetails: []
    lookbackDuration: 5h
    enabled: false
eventGroupingSettings:
  aggregationKind: SingleAlert
customDetails:
  ServicePrincipalId: ServicePrincipalObjectID
  AddedPermission: AddedPermission
entityMappings:
- entityType: Account
  fieldMappings:
  - columnName: AccountCustomEntity
    identifier: FullName
- entityType: IP
  fieldMappings:
  - columnName: IPCustomEntity
    identifier: Address
suppressionDuration: 5h

