id: c6c052b7-29a8-41d6-89f0-ed1e8ddebb53
name: Password reset on high privileged user
version: 1.0.0
kind: Scheduled
description: |-
  The password of a user that is member of a high privileged role was reset.

  Make sure that this action was intended
severity: Medium
queryFrequency: 3h
queryPeriod: 3h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - PrivilegeEscalation
query: "let HighPrivRoles = dynamic([\"Global Administrator\", \"Company Administrator\", \"Privileged Authentication Administrator\", \"Privileged Role Administrator\"]);\r\nAuditLogs\r\n| where OperationName == \"Reset user password\"\r\n| mv-expand TargetResources\r\n| extend TargetUsername = tostring(TargetResources.userPrincipalName)\r\n| join kind=innerunique (\r\n    IdentityInfo \r\n    | where TimeGenerated > ago(14d)\r\n    )\r\n    on $left.TargetUsername == $right.AccountUPN\r\n| mv-expand AssignedRoles\r\n| extend AssignedRoles = tostring(AssignedRoles)\r\n| where AssignedRoles in (HighPrivRoles)\r\n| summarize by TimeGenerated, TargetUsername, AssignedRoles, OperationName, AADUserId=AccountObjectId"
suppressionEnabled: false
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    matchingMethod: AllEntities
    reopenClosedIncident: false
    groupByCustomDetails: []
    groupByEntities: []
    groupByAlertDetails: []
    lookbackDuration: 5h
    enabled: false
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  AssignedRole: AssignedRoles
entityMappings:
  - entityType: Account
    fieldMappings:
      - columnName: AADUserId
        identifier: AadUserId
  - entityType: Account
    fieldMappings:
      - columnName: TargetUsername
        identifier: FullName
suppressionDuration: 5h
