suppressionDuration: 5h
queryPeriod: 3h
kind: Scheduled
tactics:
- PrivilegeEscalation
description: |-
  The password of a user that is member of a high privileged role was reset.

  Make sure that this action was intended
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: AadUserId
    columnName: AADUserId
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: TargetUsername
suppressionEnabled: false
queryFrequency: 3h
triggerOperator: gt
name: 'Password reset on high privileged user'
triggerThreshold: 0
query: "let HighPrivRoles = dynamic([\"Global Administrator\", \"Company Administrator\", \"Privileged Authentication Administrator\", \"Privileged Role Administrator\"]);\r\nAuditLogs\r\n| where OperationName == \"Reset user password\"\r\n| mv-expand TargetResources\r\n| extend TargetUsername = tostring(TargetResources.userPrincipalName)\r\n| join kind=innerunique (\r\n    IdentityInfo \r\n    | where TimeGenerated > ago(14d)\r\n    )\r\n    on $left.TargetUsername == $right.AccountUPN\r\n| mv-expand AssignedRoles\r\n| extend AssignedRoles = tostring(AssignedRoles)\r\n| where AssignedRoles in (HighPrivRoles)\r\n| summarize by TimeGenerated, TargetUsername, AssignedRoles, OperationName, AADUserId=AccountObjectId"
enabled: true
id: c6c052b7-29a8-41d6-89f0-ed1e8ddebb53
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: 5h
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  AssignedRole: AssignedRoles
severity: Medium

