suppressionDuration: 5h
severity: High
kind: Scheduled
description: The Azure AD Connect account is performing different sensitive actions that must not be done by this account. This is a sign of compromise for this accounts and should result in immediate action.
triggerThreshold: 0
customDetails:
  Activity: OperationName
queryFrequency: 30m
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    reopenClosedIncident: false
    lookbackDuration: 1h
    matchingMethod: Selected
    groupByEntities:
    - Account
    groupByAlertDetails: []
    groupByCustomDetails: []
suppressionEnabled: false
id: 1919c832-b23f-46bb-a110-e275b546dc78
name: Unusual sensitive action performed by Azure AD Connect account
queryPeriod: 30m
eventGroupingSettings:
  aggregationKind: AlertPerResult
triggerOperator: gt
tactics:
- LateralMovement
- Persistence
- PrivilegeEscalation
relevantTechniques:
- T1550
- T0859
- T1098
- T1078
- T0859
- T1078
- T0890
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: InitiatedByUPN
- entityType: CloudApplication
  fieldMappings:
  - identifier: AppId
    columnName: TargetResourcesId
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: InitiatedByIpAddress
- entityType: CloudApplication
  fieldMappings:
  - identifier: Name
    columnName: TargetResourcesname
query: |-
  let SensitiveActions = dynamic(["Update service principal","Add service principal credentials","Add owner to service principal","Add delegated permission grant"]);
  AuditLogs
  | extend InitiatedByUPN = parse_json(tostring(InitiatedBy.user)).userPrincipalName
  | where InitiatedByUPN startswith "Sync_" and InitiatedByUPN endswith "onmicrosoft.com"
  | where OperationName in~ (SensitiveActions)
  | mv-expand TargetResources
  | where TargetResources.type == "ServicePrincipal"
  | extend TargetResourcesname = TargetResources.name
  | extend TargetResourcesId = TargetResources.id
  | extend InitiatedByIpAddress = parse_json(tostring(InitiatedBy.user)).ipAddress

