id: 1919c832-b23f-46bb-a110-e275b546dc78
name: Unusual sensitive action performed by Entra Connect account
version: 1.0.1
kind: Scheduled
description: The Microsoft Entra Connect account is performing different sensitive actions that must not be done by this account. This is a sign of compromise for this accounts and should result in immediate action.
severity: High
queryFrequency: 30m
queryPeriod: 30m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - LateralMovement
  - Persistence
  - PrivilegeEscalation
relevantTechniques:
  - T1550
  - T0859
  - T1098
  - T1078
  - T0859
  - T1078
  - T0890
query: |-
  let SensitiveActions = dynamic([
    "Add conditional access policy",
    "Update conditional access policy",
    "Delete policy",
    "Update service principal",
    "Update application – Certificates and secrets management",
    "Add service principal credentials",
    "Add owner to service principal",
    "Add owner to application",
    "Add delegated permission grant"
  ]);
  AuditLogs
  | extend InitiatedByUPN = parse_json(tostring(InitiatedBy.user)).userPrincipalName
  | where InitiatedByUPN startswith "Sync_" and InitiatedByUPN endswith "onmicrosoft.com"
  | where OperationName in~ (SensitiveActions)
  | mv-expand TargetResources
  | where TargetResources.type == "ServicePrincipal"
  | extend TargetResourcesname = TargetResources.name
  | extend TargetResourcesId = TargetResources.id
  | extend InitiatedByIpAddress = parse_json(tostring(InitiatedBy.user)).ipAddress
suppressionDuration: 5h
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    matchingMethod: Selected
    reopenClosedIncident: false
    groupByCustomDetails: []
    groupByEntities:
      - Account
    groupByAlertDetails: []
    lookbackDuration: 1h
    enabled: true
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  Activity: OperationName
entityMappings:
  - entityType: Account
    fieldMappings:
      - columnName: InitiatedByUPN
        identifier: FullName
  - entityType: CloudApplication
    fieldMappings:
      - columnName: TargetResourcesId
        identifier: AppId
  - entityType: IP
    fieldMappings:
      - columnName: InitiatedByIpAddress
        identifier: Address
  - entityType: CloudApplication
    fieldMappings:
      - columnName: TargetResourcesname
        identifier: Name
suppressionEnabled: false
