kind: Scheduled
version: 1.0.0
description: The Azure AD Connect account is performing different sensitive actions that must not be done by this account. This is a sign of compromise for this accounts and should result in immediate action.
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: InitiatedByUPN
- entityType: CloudApplication
  fieldMappings:
  - identifier: AppId
    columnName: TargetResourcesId
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: InitiatedByIpAddress
- entityType: CloudApplication
  fieldMappings:
  - identifier: Name
    columnName: TargetResourcesname
suppressionDuration: 5h
name: Unusual sensitive action performed by Azure AD Connect account (UEBA)
id: 23fd3ffc-3d2f-4415-89ad-ce2b6450a5c3
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    reopenClosedIncident: false
    lookbackDuration: 1h
    matchingMethod: Selected
    groupByEntities:
    - Account
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: AlertPerResult
queryFrequency: 1h
query: |-
  let DirectorySyncAdmins = (IdentityInfo
      | where TimeGenerated > ago(14d)
      | where AssignedRoles contains "Directory Synchronization Accounts"
      | distinct AccountUPN);
  let SensitiveActions = dynamic(["Update service principal", "Add service principal credentials", "Add owner to service principal", "Add delegated permission grant"]);
  AuditLogs
  | where TimeGenerated > ago(1h)
  | extend InitiatedByUPN = parse_json(tostring(InitiatedBy.user)).userPrincipalName
  | where InitiatedByUPN in ( DirectorySyncAdmins )
  | where OperationName in~ (SensitiveActions)
  | mv-expand TargetResources
  | where TargetResources.type == "ServicePrincipal"
  | extend TargetResourcesname = TargetResources.name
  | extend TargetResourcesId = TargetResources.id
  | extend InitiatedByIpAddress = parse_json(tostring(InitiatedBy.user)).ipAddress
suppressionEnabled: false
customDetails:
  Activity: OperationName
severity: High
queryPeriod: 14d
relevantTechniques:
- T1550
- T0859
- T1098
- T1078
- T0859
- T1078
- T0890
tactics:
- LateralMovement
- Persistence
- PrivilegeEscalation
triggerThreshold: 0
triggerOperator: gt

